[
    {
        "testimonial": "Dorian has a remarkable ability to capture not only what you want but what you need through design. ... They can consistently back every design with customer data, competitor analysis or best practice so you know that every detail has been thoughtfully created in a way that keeps user experience at its heart.",
        "persona": "Sidonie Lawrie, Head of Product at Nurtur.Tech, Former Digital CX Product Lead at Morses Club"
    },
    {
        "testimonial": "During our time together at Morses Club, Dorian consistently demonstrated a deep understanding of industry standards and trends in UI/UX design space. ... Dorian's talent, professionalism, and commitment to delivering top-notch work make them a valuable asset to any team.",
        "persona": "Troy M, Business Analyst at CMAC Group, Former Business Analyst at Morses Club"
    },
    {
        "testimonial": "Amazing user experience website designer. Seriously can’t praise Dorian enough if you are like me and you don’t have time to hold someone’s hand through the process and you need someone who can take control of the project and make it happen. Dorian is the person for you. Their knowledge of users and the attention to detail on the user experience is amazing. I really can’t praise them high enough. Feel very proud to have them on the team building our new website.",
        "persona": "Louise Broadway, Founder & CEO of Devon Healing Horsemanship"
    },
    {
        "testimonial": "Dorian’s design expertise and attention to detail are absolutely fantastic. They’ve got an amazing grasp of what a great user experience looks like and it makes the building of a project that much easier when you’ve got someone with their expertise on board. Highly recommend you reach out to Dorian if you need someone to design on a project for you; I know I will!",
        "persona": "Craig Fahrenholz, IT Manager at NAFEMS & Initial developer for the DHH website"
    },
    {
        "testimonial": "We contracted Dorian to design our upcoming website for Very Evil Demons; we got an absolutely fantastic design, with clear and easy to understand layouts, and detailed attention paid to our aesthetic and requirements. Dorian was communicative, easy to exchange feedback with, and was overall excellent to work with as a contractor.",
        "persona": "Jordan Brown, Software Engineer and Game Optimisation Expert at Very Evil Demons LLC."
    },
    {
        "testimonial": "I'd say that as a writer, I wouldn't know the first thing about UX design... Except, I do, because Dorian was more than happy to explain to me some of the basics and show me how to get started in Figma. Dorian is always working on some sort of project, honing their skills and then blowing everyone away with them. From their volunteer work to their impressive work on the DailyUI challenge (completing 100 UI prompts), this is the kind of person who has found their calling; a rare gem that any employer would be wise to curate. If you need a job done, they will get it done.",
        "persona": "T. Catt, Eisner-Nominated Writer"
    }
]